Repository: inrae/ALAMODE-cuspy
Catalog: sphinx-doc/tm/cuspy-level1.tmx
Source language: en_gb
Languages: fr_fr

source: "Parameter identifiability analysis assesses whether it is theoretically possible to estimate unique parameter values from data, given the quantities measured, conditions present in the forcing data, model structure (and objective function), and properties of errors in the model and observations.
fr_fr: "L'analyse d'identifiabilité des paramètres étudie si c'est théoriquement possible d'estimer valeurs des paramètres uniques depuis les données, d'après les quantités mesurées, les conditions présentes dans les données de forçage, la structure du modèle (et fonction objectif), et les caractéristiques des erreurs dans le modèle et les observations.

source: 'morris' for Morris's method (one parameter at a time) or 'sobol' for Sobol's method.
fr_fr: 'morris' pour la méthode de Morris (un paramètre à la fois) ou 'sobol' pour la méthode de Sobol.

source: (1998) proposed the following sigmoid equation:
fr_fr: (1998) a proposé l'équation sigmoïde suivante :

source: **2.5% confidence value**
fr_fr: **Confidence 2,5 %**

source: **97.5% confidence value**
fr_fr: **Confidence 97,5 %**

source: **Definition**
fr_fr: **Définition**

source: **Details**
fr_fr: **Détails**

source: **Function**
fr_fr: **Fonction**

source: **Global optimum:** best solution across the entire parameter space.
fr_fr: **Optimum global :** meilleure solution au large de l'entier espace des paramètres.

source: **Local optimum:** best solution in its immediate neighbourhood in the parameter space.
fr_fr: **Optimum local :** meilleure solution dans le voisinage immédiat dans l'espace des paramètres.

source: **Mean**
fr_fr: **Moyenne**

source: **PEST++ variables** (optional) [#first]_
fr_fr: **PEST++ variables** (optionnelle) [#first]_

source: **Parallelized**
fr_fr: **Parallélisé**

source: **Parameter**
fr_fr: **Paramètre**.

source: **Posterior variance**
fr_fr: **Variance a posteriori**

source: **Prior variance**
fr_fr: **Variance a priori**

source: **Reduction in par.
fr_fr: **Réduction dans l'incertitude

source: **Run time (s)**
fr_fr: **Temps calcul (s)**

source: **Term**
fr_fr: **Terme**

source: **control data** (mandatory)
fr_fr: **control data** (obligatoire)

source: **model command line** (mandatory)
fr_fr: **model command line** (obligatoire)

source: **model input** (mandatory)
fr_fr: **model input** (obligatoire)

source: **model output** (mandatory)
fr_fr: **model output** (obligatoire)

source: **observation data** (mandatory)
fr_fr: **observation data** (obligatoire)

source: **observation groups** (mandatory)
fr_fr: **observation groups** (obligatoire)

source: **parameter data** (mandatory)
fr_fr: **parameter data** (obligatoire)

source: **parameter groups** (mandatory)
fr_fr: **parameter groups** (obligatoire)

source: **regularization** (optional)
fr_fr: **regularization** (optionnelle)

source: **singular value decomposition** (optional)
fr_fr: **singular value decomposition** (optionnelle)

source: *Environmental Modelling & Software* 114, 29-39.
fr_fr: *Environmental Modelling and Software* 114, 29-39.

source: *Environmental Modelling & Software* 119, 418-432.
fr_fr: *Environmental Modelling and Software* 119, 418-432.

source: *Environmental Modelling & Software* 21, 602-614.
fr_fr: *Environmental Modelling and Software* 21, 602-614.

source: *Environmental Modelling & Software*, 109, 191-201.
fr_fr: *Environmental Modelling and Software* 109, 191-201.

source: *Environmental Modelling & Software*, 85, 217-228.
fr_fr: *Environmental Modelling and Software* 85, 217-228.

source: 2015 is outside the predictive error range may indicate a model inadequacy.
fr_fr: 2015 soit dehors le range d'erreur prédictive peut indiquer une imperfection du modèle.

source: 2018) and air temperature from the SAFRAN reanalysis (Quintana-Seguí et al., 2008), shown in the following figure.
fr_fr: 2018) et la température de l'air de la réanalyse SAFRAN (Quintana-Seguí et al., 2008), montrées dans la figure suivante.

source: :file:`test_0_input.py`: it illustrates input file management.
fr_fr: :file:`test_0_input.py`: il démontre la gestion des fichiers d'entrée.

source: :file:`test_1_overdet.py`: it provides examples of calibration in the overdetermined case, with GLM or DE algorithms.
fr_fr: :file:`test_1_overdet.py`: il donne des exemples de calibration dans le cas surdéterminé, avec les algorithmes GLM ou DE.

source: :file:`test_2_calib_reg.py`: it provides an example of calibration in the under-determined case, using Tikhonov regularisation.
fr_fr: :file:`test_2_calib_reg.py`: il donne un exemple de calibration dans le cas sous-déterminé, en utilisant la régularisation de Tikhonov.

source: :file:`test_3_sensitivity.py`: it exemplifies the realisation of a global sensitivity analysis.
fr_fr: :file:`test_3_sensitivity.py`: il exemplifie la réalisation d'une analyse de sensitivité globale.

source: :file:`test_4_monte_carlo.py`: it shows how to carry Monte Carlo simulations.
fr_fr: :file:`test_4_monte_carlo.py`: il montre comment faire des simulations de Monte Carlo simulations.

source: :file:`test_5_ies.py`: it shows an application of Iterative Ensemble Smoothing.
fr_fr: :file:`test_5_ies.py`: il montre une application du Lissage Itératif d'Ensemble (Iterative Ensemble Smoothing).

source: :file:`test_6_uncertainty.py`: it shows an example of calibration and uncertainty analysis.
fr_fr: :file:`test_6_uncertainty.py`: il montre un exemple de calibration et d'analyse d'incertitudes.

source: :func:`calibration`: calibrate model.
fr_fr: :func:`calibration` : calibre le modèle.

source: :func:`get_obs_data`: Get observation data.
fr_fr: :func:`get_obs_data`: Obtient des données observées.

source: :func:`gsa`: Global Sensitivity Analysis.
fr_fr: :func:`gsa` : Analyse de Sensitivité Globale.

source: :func:`ies`: Iterative Ensemble Smoother.
fr_fr: :func:`ies` : Lissage Itératif d'Ensemble.

source: :func:`launch_pestpp`: launch PEST++ executable
fr_fr: :func:`launch_pestpp`: lance l'exécutable PEST++

source: :func:`linear_uncertainty`: predictive uncertainty.
fr_fr: :func:`linear_uncertainty` : incertitude prédictive.

source: :func:`monte_carlo`: Monte Carlo simulations.
fr_fr: :func:`monte_carlo` : simulation de Monte Carlo.

source: :func:`process_sweep_out`: Process file :file:`sweep_out.csv`.
fr_fr: :func:`process_sweep_out`: Traite fichier :file:`sweep_out.csv`.

source: :func:`write_dict`: Write dictionary to file.
fr_fr: :func:`write_dict`: Écrit un dictionnaire à un fichier.

source: :func:`write_dummy_pred_file`: Write a predictions file with dummy values.
fr_fr: :func:`write_dummy_pred_file`: Écrit un fichier de prédictions avec des valeurs fictives.

source: :func:`write_ins_file`: Write PEST instruction file.
fr_fr: :func:`write_ins_file`: Écrit le fichier PEST d'instructions.

source: :func:`write_par_data_file`: Write parameter data file.
fr_fr: :func:`write_tpl_file`: Écrit le fichier de paramètres modèle de PEST.

source: :func:`write_pest_files`: Writes PEST files.
fr_fr: :func:`write_pest_files`: Écrit les fichiers de PEST.

source: :func:`write_tpl_file`: Write PEST template parameter file.
fr_fr: :func:`write_tpl_file`: Écrit le fichier de paramètres modèle de PEST.

source: A :class:`LinearAnalysis` object (``analysis='prior'``), a :class:`Schur` object (``analysis='schur'``) or an :class:`ErrVar` object (``analysis='err_var'``).
fr_fr: Un objet :class:`LinearAnalysis` (``analysis='prior'``), un objet :class:`Schur` (``analysis='schur'``) ou un objet :class:`ErrVar` (``analysis='err_var'``).

source: A PEST(++) instruction file (a text file specifying how to process a model output file to read the simulation results corresponding to the observations and predictions of interest).
fr_fr: Un fichier d'instruction PEST(++) (un fichier texte qui spécifie comment traiter la sortie d'un modèle pour lire les résultats de simulation qui correspondent aux observations et prédictions d’intérêt).

source: A PEST(++) template parameter file (a text file specifying the format of the parameter file).
fr_fr: Un fichier de paramètres modèle de PEST(++) (un fichier texte qui spécifie le format du fichier de paramètres).

source: A binary covariance matrix file (.jco or .jcb).
fr_fr: Un fichier binaire de matrice de covariances (.jco or .jcb).

source: A bit of theory
fr_fr: Un peu de théorie

source: A file located at `path` where the dictionary data is written.
fr_fr: Un fichier situé à "path" où le contenu du dictionnaire data est écrit.

source: A file with the same format as the output file, filled with dummy values.
fr_fr: Un fichier avec le même format que le fichier de sortie, rempli avec des données fictives.

source: A first (expert-based) estimation of model parameters
fr_fr: Une première estimation des paramètres du modèle (basée sur l'avis d'expert)

source: A glossary of technical terms has been created to improve the consistency of the translation.
fr_fr: Un glossaire de termes techniques a été créé pour améliorer la consistance de la traduction.

source: A model cannot reproduce exactly the behaviour of a natural system because of our limited knowledge of the system.
fr_fr: Un modèle ne peut pas reproduire exactement le comportement d'un système naturel à cause de nos connaissances limitées du système.

source: A model receives forcing data (input data) and transforms it into output data (simulation) by applying a series of mathematical procedures.
fr_fr: Un modèle reçoit des données de forçage (données d'entrée) et les transforme en données de sortie (simulation) par l'application d'une série de procédures mathématiques.

source: A modified PEST control file (`pst_file1`) and a Jacobian matrix file are also created file in the process.
fr_fr: Un fichier de contrôle PEST modifié (`pst_file1`) et une matrice de Jacobi sont aussi créés pendant le procès.

source: A modified pest control file and the associated output files.
fr_fr: Un fichier de contrôle PEST modifié et ses fichiers de sortie associés.

source: A modified pst file and associated files containing results.
fr_fr: Un fichier pst modifié et ses fichiers associés qui contiennent les résultats.

source: A note of caution
fr_fr: Une note d'avertissement

source: A note on the use of linear an nonlinear uncertainty methods
fr_fr: Une note sur l'utilisation de méthodes d'analyse de l'incertitude linéaires et non-linéaires

source: A pandas dataframe containing the row and column indexes of observations in the output file, the observation names and groups, and their weights.
fr_fr: Un dataframe pandas qui contient les indexes des files et colonnes des observations dans le fichier de sortie, les noms et groupes des observations, et leur poids.

source: A parameter uncertainty file (.unc).
fr_fr: Un fichier d'incertitude des paramètres (.unc).

source: A performance threshold is used to separate between "acceptable" and "unacceptable" simulations (and parameter sets).
fr_fr: On utilise un seuil de performance pour séparer entre des simulations "acceptables" et "inacceptables" (et ensembles de paramètres).

source: A pest file (`pst_file1`) and associated files containing the results of the calibration process are also created.
fr_fr: Un fichier PEST (`pst_file1`) et les fichiers associés qui contiennent les résultats du procès de calibration sont créés aussi.

source: A pest instance where the parameter values correspond to the calibrated values.
fr_fr: Une instance PEST où les valeurs des paramètres correspondent aux valeurs calibrées.

source: A posteriori predictive uncertainty is the uncertainty of forecasts after incorporating new measurements.
fr_fr: L'incertitude prédictive a posteriori est l'incertitude des prédictions après l'incorporation des nouvelles mesures.

source: A predictions file filled with dummy values may be useful when it is necessary to obtain simulation results for a certain period and there are no observations available.
fr_fr: Un fichier de prédictions rempli avec des données fictives peut être utile quand on veut obtenir des résultats de simulation pour une période de temps pour lequel il n'y a pas d'observations disponibles.

source: A priori predictive uncertainty is the uncertainty of forecasts made before incorporating the information of new measurements.
fr_fr: L'incertitude prédictive a priori est l'incertitude des prédictions faites avant d'incorporer l'information de nouvelles mesures.

source: A series of PEST files (control file, instructions file and template parameter file) and a parameter file.
fr_fr: Une série de fichiers PEST (fichier de contrôle, fichier d'instructions et fichier de paramètres modèle) et un fichier de paramètres.

source: A series of text files containing the base simulation, the minimum, maximum, and the percentiles 5%, 25%, 50%, 75% and 95% of the simulations in the :file:`sweep_out.csv` file.
fr_fr: Une série de fichiers texte qui contiennent la simulation de base, le minimum, le maximum et les percentiles 5%, 25%, 50%, 75% et 95% des simulations dans le fichier :file:`sweep_out.csv`.

source: A similar analysis can be made by removing observations or groups of observations with the methods :meth:`get_removed_obs_importance` and :meth:`get_removed_obs_group_importance`.
fr_fr: Un analyse similaire peut être fait par l'élimination d'observations ou groupes d'observations avec les méthodes :meth:`get_removed_obs_importance` et :meth:`get_removed_obs_group_importance`.

source: A simulation is only as good as data and model specification allow it to be.
fr_fr: Une simulation ne peut pas être meilleur que ce que lui permettent les données et la spécification du modèle.

source: A single prior covariance matrix file (.cov).
fr_fr: Un unique fichier de matrice de covariances a priori (.cov).

source: According to parameter identifiability results (again, using 2 singular values), the calibration data allow to determine uniquely the value of :math:`\gamma` (identifiability near to one).
fr_fr: D'après les résultats d'identifiabilité des paramètres (à nouveau, en utilisant 2 valeurs singulières), les données de calibration nous permettent de déterminer comme une valeur unique la valeur de :math:`\gamma` (identifiabilité proche à un).

source: According to the GNU General Public License, a copyright notice is included in every module.
fr_fr: D'accord avec la Licence Publique Générale GNU, une notice de copyright est incluse dans chaque module.

source: According to these results, predictive error is greater in the summer and in the winter, in coherence with the results for posterior uncertainty.
fr_fr: D'après ces résultats, l'erreur prédictive est plus importante en été et en hiver, en cohérence avec les résultats obtenus pour l'incertitude a posteriori.

source: After applying a global calibration method it is advisable to refine the calibration with a local method.
fr_fr: Après l'application d'une méthode de calibration globale il est conseillé de raffiner la calibration avec une méthode locale.

source: After calibration the uncertainty of the parameters has been much reduced.
fr_fr: Après la calibration l'incertitude des paramètres a diminué beaucoup.

source: Air temperature has been created using a seasonal component and an ARMA model, while solar radiation data corresponds to the seasonal component only.
fr_fr: La température de l'air a été créée à l'aide d'une composante saisonnière et un modèle ARMA, tandis que les données de rayonnement solaire correspondent seulement à la composante saisonnière

source: All these different types of measurement could be assigned to different groups.
fr_fr: Tous ces différents types de mesures pourraient être assignés à des différents groupes.

source: Also, many studies have calibrated that model in several instances, so that we can use expert judgement to provide an estimation of the expected value and range of the parameters of the model.
fr_fr: Aussi, beaucoup d'études ont calibré ce modèle dans plusieurs cas, et en conséquence on peut utiliser l'avis d'expert pour avoir une estimation de la valeur espérée et du rang de variation des paramètres du modèle.

source: Also, parameters are correlated among themselves.
fr_fr: Aussi, les paramètres sont corrélés entre eux.

source: Also, since the sum of :math:`S_i` is less than 1, the sum of :math:`S_{T_i}` is greater than 1, and :math:`S_{T_i}>S_i` for the parameters :math:`\alpha`, :math:`\beta` and :math:`\gamma`, there are interactions between these parameters.
fr_fr: De plus, comme la somme de :math:`S_i` est moins de 1, la somme de :math:`S_{T_i}` est plus de 1, et :math:`S_{T_i}>S_i` pour les paramètres :math:`\alpha`, :math:`\beta` et :math:`\gamma`, il y a des interactions entre ces paramètres.

source: Also, the Iterative Ensemble Smoother, rather than finding an optimum set of parameter values, obtains several optimum sets of parameter values.
fr_fr: Aussi, le Lissage Itératif d'Ensemble, plutôt que chercher un seul ensemble de valeurs des paramètres optimales, en obtient plusieurs.

source: Also, the calibrated model may be useful to inform initial stages of the modelling process (e.g., which additional measurements to take) in successive iterations.
fr_fr: De plus, le modèle calibré peut être d'utilité pour donner support aux étapes initiales du procès de modélisation (p. ex., quelles mesures additionnelles il faudrait prendre) en itérations postérieures.

source: Also, the calibration data informs the values of the parameters.
fr_fr: Aussi, les données de calibration conditionnent les valeurs des paramètres.

source: Also, the model may even simulate state variables for which there are no available observations.
fr_fr: De plus, le modèle peut même simuler variables d'état pour lesquels il n0y a pas des observations disponibles.

source: Alternatively, if the model has binary output or several output files, you may need to create a script to process the model output so that it conforms with the recommended format (text file separated by spaces with the date in the first column).
fr_fr: Alternativement, si le modèle a des sorties binaires ou plusieurs fichiers de sortie, vous pourrez avoir besoin de créer un script pour traiter le retour du modèle de façon qu'il soit conforme au format conseillé (fichier texte séparé par des espaces avec la date sur la première colonne).

source: Although environmental models are largely nonlinear, linear methods may also be applied to them if the uncertainty of model parameters is low enough.
fr_fr: Bien que les modèles environnementaux soient largement non linéaires, les méthodes linéaires peuvent y être appliquées aussi si l'incertitude du modèle est suffisamment petite.

source: An assessment that a model computer code does not reproduce some observed behaviour of the system to an acceptable degree.
fr_fr: L'appréciation que le code informatique d'un modèle ne reproduis pas quelque comportement observé du système étudié avec une qualité acceptable.

source: An example is shown below.
fr_fr: On montre un exemple ci-dessous.

source: An example: simulation of surface water temperature
fr_fr: Un exemple : simulation de la température de la surface de l'eau

source: An important concept in the modelling process is that of identifiability.
fr_fr: Un concept important dans le procès de modélisation est celui d'identifiabilité.

source: An uncertainty file can be provided with the PEST++ control variable ``parcov``.
fr_fr: Un fichier d'incertitude peut être donné avec la variable de contrôle de PEST++ ``parcov``.

source: Analyse the evaluation of model performance and assess whether any refinement is necessary in the process, going back to previous stages if necessary.
fr_fr: Il faut analyser l'évaluation de la performance du modèle et voire s'il est nécessaire de faire quelque amélioration dans le procès, retournant aux étapes antérieures s'il le faut.

source: Analysing the uncertainty about model structure (or about the relationships between variables characterizing the behaviour of the system).
fr_fr: L'analyse de l'incertitude de la structure du modèle (ou sur les relations entre les variables qui caractérisent le comportement du système).

source: Analysing the uncertainty about the value of the parameters.
fr_fr: L'analyse de l'incertitude de la valeurs des paramètres.

source: Analysing the uncertainty of forecasts made using the model or predictive uncertainty.
fr_fr: L'analyse de l'incertitude des prédictions faites avec le modèle ou incertitude prédictive.

source: Analysis process
fr_fr: Le procès d'analyse

source: And assume we need to estimate it.
fr_fr: Et supposez que nous avons besoin de l'estimer.

source: And the parameter :math:`\mu` is noninfluential since its total effect index is nearly zero.
fr_fr: Et le paramètre :math:`\mu` n'a pas d'influence puisque son index d'effets totaux est presque zéro.

source: And to install :mod:`latexmk`, type:
fr_fr: Et pour installer :mod:`latexmk`, tapez :

source: And to obtain a summary of these, type:
fr_fr: Et pour en obtenir un résumé, tapez :

source: Answering this question is the aim of the sensitivity analysis.
fr_fr: Répondre à cette question est l'objectif de l'analyse de sensitivité.

source: Application of forecasting to past data as if the inputs and outputs were only available up to a certain point in time.
fr_fr: Application de la technique de prédiction à données dans le passé comme si les entrées et sorties n'était disponibles que jusqu'à un certain point dans le temps.

source: Applied using the function :func:`gsa`.
fr_fr: Appliqué en utilisant la fonction :func:`gsa`.

source: Appropriate for linear or quasi-linear models.
fr_fr: Approprié pour des modèles linéaires ou presque linéaires.

source: Are there any factors or group of factors that interact between themselves?
fr_fr: Il y a des facteurs ou groupes de facteurs qu'interagissent entre eux ?

source: Are there any factors we need to investigate more in depth to be more confident on the model output?
fr_fr: Il y a des facteurs qu'il faudrait investiguer plus en détail pour augmenter la crédibilité du retour du modèle ?

source: Are there any factors which have an insignificant influence on model output, so that they can be discarded from subsequent analyses?
fr_fr: Il y a des facteurs qui ont une influence méprisable sur le retour du modèle, de façon qu'ils puissent être écartés dans les analyses subséquentes ?

source: Are there regions in the input space where the variation in the model output is maximum?
fr_fr: Il y a des régions dans l'espace des entrées pour lesquelles la variation du retour du modèle est maximale ?

source: As a result, there is uncertainty in the boundary conditions of the model (initial state and forcing data) and system state.
fr_fr: En conséquence, il y a incertitude sur les conditions de frontière du modèle (état initial et données de forçage) et état du système.

source: As approximations of reality, models are often used to inform management decisions and to understand better the behaviour of the systems they try to reproduce.
fr_fr: En fonction d'approximations de la réalité, les modèles sont souvent utiliser pour donner support à des décisions de gestion et pour comprendre mieux le comportement des systèmes qu'ils essayent de reproduire.

source: Assume we did not have any available data on surface temperature in the reservoir.
fr_fr: Supposez que nous n'avons pas de données sur la température de la surface dans le réservoir.

source: At the end of the process, we hope to obtain a model that has the following characteristics (Beck 1987):
fr_fr: À la fin du procès, on espère d'atteindre un modèle qui ait les caractéristiques suivantes (Beck 1987) :
